In [ ]:
#In this exercise, you will work with a dataset called "employee info" that contains information about employees in a company. The dataset includes columns such as Name, Department, Age, Gender, Salary, and Experience.
#Instructions
#Create a dataframe called "employee_df" with the following data:
#Use the iloc method to select the first 3 rows of the dataframe.
#Use the loc method to select all rows where the Department is "Marketing".
#Use the iloc method to select the Age and Gender columns for the first 4 rows of the dataframe.
#Use the loc method to select the Salary and Experience columns for all rows where the Gender is "Male".

In [1]:
import pandas as pd
import numpy as np

In [4]:
#Create a dataframe called "employee_df" with the following data
data = {'Name': ['John', 'Mary', 'Bob', 'Sarah', 'Tom', 'Lisa'], 
        'Department': ['IT', 'Marketing', 'Sales', 'IT', 'Finance', 'Marketing'], 
        'Age': [30, 40, 25, 35, 45, 28], 
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female'], 
        'Salary': [50000, 60000, 45000, 55000, 70000, 55000], 
        'Experience': [3, 7, 2, 5, 10, 4]}

employee_df = pd.DataFrame(data)
employee_df

    Name Department  Age  Gender  Salary  Experience
0   John         IT   30    Male   50000           3
1   Mary  Marketing   40  Female   60000           7
2    Bob      Sales   25    Male   45000           2
3  Sarah         IT   35  Female   55000           5
4    Tom    Finance   45    Male   70000          10
5   Lisa  Marketing   28  Female   55000           4

In [5]:
#Use the iloc method to select the first 3 rows of the dataframe.
first_three_rows = employee_df.iloc[:3]
print(first_three_rows)

   Name Department  Age  Gender  Salary  Experience
0  John         IT   30    Male   50000           3
1  Mary  Marketing   40  Female   60000           7
2   Bob      Sales   25    Male   45000           2

In [6]:
#Use the loc method to select all rows where the Department is "Marketing".
marketing_department = employee_df.loc[employee_df['Department'] == 'Marketing']
print(marketing_department)

   Name Department  Age  Gender  Salary  Experience
1  Mary  Marketing   40  Female   60000           7
5  Lisa  Marketing   28  Female   55000           4

In [7]:
#Use the iloc method to select the Age and Gender columns for the first 4 rows of the dataframe.
age_gender_first_four = employee_df.iloc[:4, [2, 3]]  # Columns 2 and 3 correspond to Age and Gender
print(age_gender_first_four)

   Age  Gender
0   30    Male
1   40  Female
2   25    Male
3   35  Female

In [8]:
#Use the loc method to select the Salary and Experience columns for all rows where the Gender is "Male".
male_salary_experience = employee_df.loc[employee_df['Gender'] == 'Male', ['Salary', 'Experience']]
print(male_salary_experience)

   Salary  Experience
0   50000           3
2   45000           2
4   70000          10